# Tackling spaces in data frames when importing files

In [33]:
from pandas import DataFrame, Series
import pandas as pd
import matplotlib.pyplot as plt
from pandas.io.json import json_normalize
from pprint import pprint

In [30]:
df = pd.read_csv(r'C:\DATA\people.txt', skipinitialspace=True, \ 
                 dtype={'personid': np.int32, 'name':np.object, 'address': np.object, 'phone': np.object})

SyntaxError: unexpected character after line continuation character (<ipython-input-30-b481de2c5421>, line 1)

In [25]:
df

  personid                 name      address         phone
l      bob       "1 high street     croydon"    8389654422
2       Ri    "45 lindon avenue   Islington"   67842068074
3    Poppy        "369 Yolk rd"      Ruislip  528462094908
4    Rakei   "3 Sycamore Close"         Kent    6342803528
5    Frank    "81 Lacare Street   Tottenham"    6352994726

In [5]:
#for datatypes in dataframes you write dtypes not type

In [26]:
df.dtypes

personid    object
 name       object
 address    object
 phone       int64
dtype: object

### Normalizing data frames

### Example 1

In [31]:
data = [{'id': 1, 'name': {'first': 'Coleen', 'last': 'Volk'}}, {'name': {'given': 'Mose', 'family': 'Regner'}}, {'id': 2, 'name': 'Faye Raker'}]

In [34]:
pprint(data)

[{'id': 1, 'name': {'first': 'Coleen', 'last': 'Volk'}},
 {'name': {'family': 'Regner', 'given': 'Mose'}},
 {'id': 2, 'name': 'Faye Raker'}]

In [35]:
df = DataFrame(data)

In [36]:
df

    id                                   name
0  1.0    {'first': 'Coleen', 'last': 'Volk'}
1  NaN  {'given': 'Mose', 'family': 'Regner'}
2  2.0                             Faye Raker

In [37]:
json_normalize(data)

    id        name name.family name.first name.given name.last
0  1.0         NaN         NaN     Coleen        NaN      Volk
1  NaN         NaN      Regner        NaN       Mose       NaN
2  2.0  Faye Raker         NaN        NaN        NaN       NaN

### Example 2

In [39]:
data2 = [{'state': 'Florida', 'shortname': 'FL', 'info': {'governor': 'Rick Scott'}, 'counties': [{'name': 'Dade', 'population': 12345}, {'name': 'Broward', 'population': 40000}, {'name': 'Palm Beach', 'population': 60000}]}, {'state': 'Ohio', 'shortname': 'OH', 'info': {'governor': 'John Kasich'}, 'counties': [{'name': 'Summit', 'population': 1234}, {'name': 'Cuyahoga', 'population': 1337}]}]

In [40]:
pprint(data2)

[{'counties': [{'name': 'Dade', 'population': 12345},
               {'name': 'Broward', 'population': 40000},
               {'name': 'Palm Beach', 'population': 60000}],
  'info': {'governor': 'Rick Scott'},
  'shortname': 'FL',
  'state': 'Florida'},
 {'counties': [{'name': 'Summit', 'population': 1234},
               {'name': 'Cuyahoga', 'population': 1337}],
  'info': {'governor': 'John Kasich'},
  'shortname': 'OH',
  'state': 'Ohio'}]

In [45]:
#Counties is wanted on the outer most LHS therefore it comes first
json_normalize(data2, 'counties', ['state', 'shortname', ['info', 'governor']])

         name  population    state shortname info.governor
0        Dade       12345  Florida        FL    Rick Scott
1     Broward       40000  Florida        FL    Rick Scott
2  Palm Beach       60000  Florida        FL    Rick Scott
3      Summit        1234     Ohio        OH   John Kasich
4    Cuyahoga        1337     Ohio        OH   John Kasich